HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S169WOP */
#define IFX_DMU_HP_PROCON_WOP5_S169WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S169WOP */
#define IFX_DMU_HP_PROCON_WOP5_S169WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S169WOP */
#define IFX_DMU_HP_PROCON_WOP5_S169WOP_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S170WOP */
#define IFX_DMU_HP_PROCON_WOP5_S170WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S170WOP */
#define IFX_DMU_HP_PROCON_WOP5_S170WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S170WOP */
#define IFX_DMU_HP_PROCON_WOP5_S170WOP_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S171WOP */
#define IFX_DMU_HP_PROCON_WOP5_S171WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S171WOP */
#define IFX_DMU_HP_PROCON_WOP5_S171WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S171WOP */
#define IFX_DMU_HP_PROCON_WOP5_S171WOP_OFF (11u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S172WOP */
#define IFX_DMU_HP_PROCON_WOP5_S172WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S172WOP */
#define IFX_DMU_HP_PROCON_WOP5_S172WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S172WOP */
#define IFX_DMU_HP_PROCON_WOP5_S172WOP_OFF (12u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S173WOP */
#define IFX_DMU_HP_PROCON_WOP5_S173WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S173WOP */
#define IFX_DMU_HP_PROCON_WOP5_S173WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S173WOP */
#define IFX_DMU_HP_PROCON_WOP5_S173WOP_OFF (13u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S174WOP */
#define IFX_DMU_HP_PROCON_WOP5_S174WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S174WOP */
#define IFX_DMU_HP_PROCON_WOP5_S174WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S174WOP */
#define IFX_DMU_HP_PROCON_WOP5_S174WOP_OFF (14u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S175WOP */
#define IFX_DMU_HP_PROCON_WOP5_S175WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S175WOP */
#define IFX_DMU_HP_PROCON_WOP5_S175WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S175WOP */
#define IFX_DMU_HP_PROCON_WOP5_S175WOP_OFF (15u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S176WOP */
#define IFX_DMU_HP_PROCON_WOP5_S176WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S176WOP */
#define IFX_DMU_HP_PROCON_WOP5_S176WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S176WOP */
#define IFX_DMU_HP_PROCON_WOP5_S176WOP_OFF (16u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S177WOP */
#define IFX_DMU_HP_PROCON_WOP5_S177WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S177WOP */
#define IFX_DMU_HP_PROCON_WOP5_S177WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S177WOP */
#define IFX_DMU_HP_PROCON_WOP5_S177WOP_OFF (17u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S178WOP */
#define IFX_DMU_HP_PROCON_WOP5_S178WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S178WOP */
#define IFX_DMU_HP_PROCON_WOP5_S178WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S178WOP */
#define IFX_DMU_HP_PROCON_WOP5_S178WOP_OFF (18u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S179WOP */
#define IFX_DMU_HP_PROCON_WOP5_S179WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S179WOP */
#define IFX_DMU_HP_PROCON_WOP5_S179WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S179WOP */
#define IFX_DMU_HP_PROCON_WOP5_S179WOP_OFF (19u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S180WOP */
#define IFX_DMU_HP_PROCON_WOP5_S180WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S180WOP */
#define IFX_DMU_HP_PROCON_WOP5_S180WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S180WOP */
#define IFX_DMU_HP_PROCON_WOP5_S180WOP_OFF (20u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S181WOP */
#define IFX_DMU_HP_PROCON_WOP5_S181WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S181WOP */
#define IFX_DMU_HP_PROCON_WOP5_S181WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S181WOP */
#define IFX_DMU_HP_PROCON_WOP5_S181WOP_OFF (21u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S182WOP */
#define IFX_DMU_HP_PROCON_WOP5_S182WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S182WOP */
#define IFX_DMU_HP_PROCON_WOP5_S182WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S182WOP */
#define IFX_DMU_HP_PROCON_WOP5_S182WOP_OFF (22u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S183WOP */
#define IFX_DMU_HP_PROCON_WOP5_S183WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S183WOP */
#define IFX_DMU_HP_PROCON_WOP5_S183WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S183WOP */
#define IFX_DMU_HP_PROCON_WOP5_S183WOP_OFF (23u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S184WOP */
#define IFX_DMU_HP_PROCON_WOP5_S184WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S184WOP */
#define IFX_DMU_HP_PROCON_WOP5_S184WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S184WOP */
#define IFX_DMU_HP_PROCON_WOP5_S184WOP_OFF (24u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S185WOP */
#define IFX_DMU_HP_PROCON_WOP5_S185WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S185WOP */
#define IFX_DMU_HP_PROCON_WOP5_S185WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S185WOP */
#define IFX_DMU_HP_PROCON_WOP5_S185WOP_OFF (25u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S186WOP */
#define IFX_DMU_HP_PROCON_WOP5_S186WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S186WOP */
#define IFX_DMU_HP_PROCON_WOP5_S186WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S186WOP */
#define IFX_DMU_HP_PROCON_WOP5_S186WOP_OFF (26u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S187WOP */
#define IFX_DMU_HP_PROCON_WOP5_S187WOP_LEN (1u)

